import React, { useState } from 'react'

export default function Posts({ posts }) {
    
//יצרתי מערך חדש שיכיל את המערך של הפוסטים, כדי שכאשר אמחק פוסטים מהמערך העמוד יתרנדר מחדש
// השתמשתי בפיזור של המערך המקורי בתוך המערך החדש כדי שיהיה בדיוק כמו המערך המקורי.
    const [pList,setPList]=useState([...posts])


// יצרתי פונקציה שתקבל פוסט ספציפי.
// הפונקציה תעבור על מערך הפוסטים החדש ותבדוק האם הפוסט שהתקבל קיים במערך
//  בגלל שאני לא יודע איזה פוסט נשלח למחיקה הלכתי על בטוח, העברתי את כל המערך למשתנה זמני חדש מסוג מערך.
// לאחר מכן מחקתי את הפוסט המתאים לפי האינדקס שהפונקציה מצאה קודם
//לבסוף עשיתי סט למערך הפוסטים החדש ופיזרתי בתוכו את המערך הזמני
// לאחר מכן התוצאה תהיה המערך המקורי ללא הפוסט שלחצו עליו איקס.
    const handleXButton=(post)=>{
        for (let i=0;i<pList.length;i++){
          if (pList[i].details===post.details){
              let temp=[...pList]
              temp.splice(i,1);
              setPList([...temp])
            
          }
        }
      }

//פונקציה זו מציגה את הפוסטים בעזרת מאפ.  
// בנוסף יש את הכפתור איקס. לחיצה עליו תשלח לפונקציה שמתעסקת עם לחיצה על איקס את הפוסט שנבחר.
// חשוב לשים לב שהקריאה לפונקציה היא באמצעות פונקציית חץ כדי שהפונקציה לא תרוץ תמיד, אם לא הייתי צריך לשלוח 
// לפונקציה פוסט ספציפי, לא הייתי צריך לעשות זאת    
const show=()=>{
    return (
        <div>
        {
            pList.map((post)=>{
                return (
                <div style={{height:'200px'}}>
                    <div>
                {'details:'+post.details}
                </div>
                <div>
                {'name:'+post.name}
                </div>
                <div >
               {post.img}
                </div>
                <div>
                    <button style={{position:'absolute'}} onClick={()=>handleXButton(post)} >X</button>
                </div>
                <br/>
                </div>
                )
            })
        }
        </div>
    )
}
    

//לבסוף יש את הריטרן של הפונקציה הכללית של הקומפוננטה.
//בין שני הדיבים יש קריאה לפונקציה שמציגה את הפוסים
// חשוב מאוד, מקודם נמנענו מקריאה תמידית של הפונקציה בעזרת פונקציית חץ. הפעם אנחנו כן רוצים שהפונקציה תקרא תמיד
// לכן שמתי סוגריים אחרי הקריאה לפונקציה    
    return (
        <div>
            
     {show()}
        </div>
    )
}
